source link: https://github.com/codebasics/py/blob/master/pandas/9_merge/pandas_merge.ipynb

In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame({
    "city":['new york','chicago','florida'],
    'temperature':[23,18,30]
})
df1

       city  temperature
0  new york           23
1   chicago           18
2   florida           30

In [3]:
df2 = pd.DataFrame({
    "city":['new york','chicago','florida'],
    'humidity':[60,58,43]
})
df2

       city  humidity
0  new york        60
1   chicago        58
2   florida        43

In [4]:
# Normal merging based on 'city'
df_merged = pd.merge(df1,df2,on= 'city')
df_merged
#by default pandas uses inner join in merging two dataframes
# Note: We can also use concat function to append columns..provided the
# indexes used are the same.

       city  temperature  humidity
0  new york           23        60
1   chicago           18        58
2   florida           30        43

In [5]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35, 38],
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [6]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "humidity": [65,68,71],
})
df2

        city  humidity
0    chicago        65
1   new york        68
2  san diego        71

In [7]:
# Similar to inner join in SQL( also referred as intersection in set theory)
df3=pd.merge(df1,df2,on="city",how="inner")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [9]:
# Similar to Outer join in SQL (also referred as union in set theory)
df3 = pd.merge(df1,df2,on= 'city', how='outer')
df3

        city  temperature  humidity
0   new york         21.0      68.0
1    chicago         14.0      65.0
2    orlando         35.0       NaN
3  baltimore         38.0       NaN
4  san diego          NaN      71.0

In [10]:
# Left join 
df3 = pd.merge(df1,df2,on='city', how = 'left')
df3

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           38       NaN

In [11]:
# Right join
df3 = pd.merge(df1,df2,on='city', how = 'right')
df3

        city  temperature  humidity
0   new york         21.0        68
1    chicago         14.0        65
2  san diego          NaN        71

In [12]:
# using indicator option as true
# indicator tells us to which table the values belong
df3 = pd.merge(df1,df2,on='city', how = 'outer', indicator = True)
df3

        city  temperature  humidity      _merge
0   new york         21.0      68.0        both
1    chicago         14.0      65.0        both
2    orlando         35.0       NaN   left_only
3  baltimore         38.0       NaN   left_only
4  san diego          NaN      71.0  right_only

In [13]:
df1 = pd.DataFrame({
    'city':['mumbai','newyork','paris'],
    'temperature':[30,23,20],
    'humidity':[69,58,54]
})

In [17]:
df2 = pd.DataFrame({
    'city':['mumbai','newyork','paris'],
    'temperature':[30,23,20],
    'humidity':[69,50,54]
})

In [18]:
# leaving suffixes as blank
df3 = pd.merge(df1,df2,on='city')
df3
# Note: when the value are similar in both the tables, pandas wisely uses
# suffixes to distinguish values the tables to which this values belong

      city  humidity_x  temperature_x  humidity_y  temperature_y
0   mumbai          69             30          69             30
1  newyork          58             23          50             23
2    paris          54             20          54             20

In [16]:
# using suffixes
df3 = pd.merge(df1,df2,on = 'city', suffixes= ('_left','_right'))
df3

      city  humidity_left  temperature_left  humidity_right  temperature_right
0   mumbai             69                30              69                 30
1  newyork             58                23              58                 23
2    paris             54                20              54                 20